// هادا ملف انشائتو انا لاعمل تعديلات على الجي كويري تبع البوتستراب
//اول مرة انشاتو فيه كان لاجل تعديل الوقت الي بتنعرض فيه الصورة تبع الكاروسل 
$(document).ready(function() {
    /* الدرس 48 : نشغيل النايس سكرول*/
    /* بتاخد الكود من الموقع بس اضغط ريد مور وتعلم */
    $(function() {
        $("body").niceScroll();
    });

    $('.carousel').carousel({
        // تاخير لمدة 5 ثوان
        interval: 6000



    });
    /*  اظهار كلور-اوبشن-ديف عندما نضغط على ايقونة الغير  */
    /* عملت سيليكت للغير تشيك اول ما اعمل عليه كليك يحصل كداا*/
    //    ----------------------------------------------------------------------------------------------------
    // ----------------------------------------------------------------------------------------------------------

    // --------------------------------------------------------
    // ----------------------------------------------------------

});


/*------------------------loading overlay بداية-------*/
$(window).load(function() {

    /* لمن الصفحة حملت كاملة طبقلي هالفنكشن */
    /* اخفيلي ال هيد1 في هذا السكشن في الف ميلي سكند */
    /* ثم اطلب الفنكشن التالي*/
    /* الفنكشن الاول : الهيد1 تحتتفي وتطلب الفتكشن التانية */
    $(".loading-overlay  .spinner").fadeOut(2000,
        function() {
            /*  الفنكشن 2: اب هذا العنصر نفسو عملو اخفاء بالف ميلي يعني الشاشة السودا ح تختفي وتطلب ال3  */
            /* تذكر انا بالس اس اس حطيت الاوفر فلو للبدي هيدن يعني التغا السكرول */
            /* بس لازم البودي ياخد خواص الي هي بودي اوفر فلو يعني يرجع ياخدا بعد مالغيتا من السي اس اس*/
            $("body").css("overflow", "auto");
            $(this).parent().fadeOut(2000,
                function() {

                    /* الفنكشن 3 : حذفلي الكشن لودينغ-اوفر لي كلو مشان ماحدى يعملو اظهار من الانسبكت */
                    $(this).remove();

                });
        });


});


// __________________________________________________________________________________________________________________________

$(function() {
    'use strict';

    // ______________________________________________________________________________________________
    $('.login-page h1 span').click(function() {
        $(this).addClass('selected').siblings().removeClass('selected');
        // ---------
        $('.login-page form').hide();
        $('.' + $(this).data('class')).fadeIn(100);

    });
});

// ________________________________________________________________________________________________